In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression

In [28]:
df = pd.read_csv('train.csv')[['Age','Pclass','SibSp','Parch','Survived']]

In [29]:
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

In [30]:
df.dropna(inplace=True)

In [31]:
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

In [32]:
x=df.drop(columns=["Survived"])
y=df["Survived"]

In [33]:
np.mean(cross_val_score(LogisticRegression(),x,y,scoring="accuracy",cv=10, error_score='raise'))

0.6921165884194054

#### Feature Construction is Manual Process use to derived features from the existing column in the data

## Applying Feature Construction

In [34]:
x["Family size"]=x["SibSp"]+x["Parch"]+1

In [36]:
x

      Age  Pclass  SibSp  Parch  Family size
0    22.0       3      1      0            2
1    38.0       1      1      0            2
2    26.0       3      0      0            1
3    35.0       1      1      0            2
4    35.0       3      0      0            1
..    ...     ...    ...    ...          ...
885  39.0       3      0      5            6
886  27.0       2      0      0            1
887  19.0       1      0      0            1
889  26.0       1      0      0            1
890  32.0       3      0      0            1

[714 rows x 5 columns]

In [39]:
def myfun(num):
    if num==1:
        #alone
        return 0
    elif num>1 and num<=4:
        return 1
    else:
        return 2

In [43]:
myfun(3)

1

In [45]:
x["Family size"]=x["Family size"].apply(myfun)

In [46]:
x

      Age  Pclass  SibSp  Parch  Family size
0    22.0       3      1      0            1
1    38.0       1      1      0            1
2    26.0       3      0      0            0
3    35.0       1      1      0            1
4    35.0       3      0      0            0
..    ...     ...    ...    ...          ...
885  39.0       3      0      5            2
886  27.0       2      0      0            0
887  19.0       1      0      0            0
889  26.0       1      0      0            0
890  32.0       3      0      0            0

[714 rows x 5 columns]

In [48]:
x.drop(columns=["SibSp","Parch"],inplace=True)

In [49]:
x.head()

    Age  Pclass  Family size
0  22.0       3            1
1  38.0       1            1
2  26.0       3            0
3  35.0       1            1
4  35.0       3            0

In [51]:
np.mean(cross_val_score(LogisticRegression(),x,y,scoring="accuracy",cv=20))

0.7003174603174602

### You can see that from above After performing Feature Construction Accuracy of the model is Increases Succesfuly!

# Feature Splitting

In [52]:
df=pd.read_csv("train.csv")

In [53]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [54]:
df["Name"]

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [58]:
df["Name"].str.split(",",expand=True)[1].str.split(".",expand=True)[0]

0         Mr
1        Mrs
2       Miss
3        Mrs
4         Mr
       ...
886      Rev
887     Miss
888     Miss
889       Mr
890       Mr
Name: 0, Length: 891, dtype: object

In [72]:
df["Title"]=df["Name"].str.split(",",expand=True)[1].str.split(".",expand=True)[0] 
#using Spli function to split data also " , " is used as separator also " ." is used to separate salutation

In [61]:
df[["Title","Name"]]

     Title                                               Name
0       Mr                            Braund, Mr. Owen Harris
1      Mrs  Cumings, Mrs. John Bradley (Florence Briggs Th...
2     Miss                             Heikkinen, Miss. Laina
3      Mrs       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       Mr                           Allen, Mr. William Henry
..     ...                                                ...
886    Rev                              Montvila, Rev. Juozas
887   Miss                       Graham, Miss. Margaret Edith
888   Miss           Johnston, Miss. Catherine Helen "Carrie"
889     Mr                              Behr, Mr. Karl Howell
890     Mr                                Dooley, Mr. Patrick

[891 rows x 2 columns]

### Splited Data Succesfully!

In [70]:
df['Is_Married'] = 0
df['Is_Married'].loc[df['Title'] == 'Mrs'] = 1

C:\Users\acer\AppData\Local\Temp\ipykernel_1588\2254989826.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Is_Married'].loc[df['Title'] == 'Mrs'] = 1

In [71]:
df['Is_Married']

0      0
1      0
2      0
3      0
4      0
      ..
886    0
887    0
888    0
889    0
890    0
Name: Is_Married, Length: 891, dtype: int64

# Conclude